app/views/users/show.html.erb

<ul>
<% @user.movies.each do | movie | %>
---
SELECT "movies".* FROM "movies" INNER JOIN "votes" ON "movies"."id" = "votes"."movie_id" WHERE "votes"."user_id" = ?  [["user_id", 12]]