app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def current_user
      if session[:current_user_id]
        @current_user = User.find(session[:current_user_id])