app/controllers/movies_controller.rb

SELECT "users".* FROM "users"
---
    def new
        @users = User.all

SELECT  "movies".* FROM "movies" WHERE (Clue) LIMIT ?  [["LIMIT", 1]]
---
    def find
        if params[:q]
            json = Movie.search(params[:q])

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT ?  [["title", "Phone Booth"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Eddie"], ["created_at", "2018-11-14 03:48:14.427661"], ["updated_at", "2018-11-14 03:48:14.427661"]]
INSERT INTO "movies" ("title", "year", "overview", "poster_path", "tmdb_id", "created_at", "updated_at", "submitter_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "votes" ("up", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["up", 1], ["user_id", 6], ["movie_id", 16], ["created_at", "2018-11-14 19:44:45.319932"], ["updated_at", "2018-11-14 19:44:45.319932"]]
---
    def create
        inescapable = eval(params[:movie])
        inescapable[:submitter_id] = current_user.id
        movie = Movie.find_or_initialize_by(title: inescapable[:title]) do | new_movie |
            new_movie.assign_attributes(inescapable)
        end

        # sets true if movie is new to the database
        is_old = !!movie.id
        movie.save

        if is_old
            redirect_to movies_path
            flash[:notice] = "Movie already added, upvoting instead"
        else
            redirect_to movies_path
            flash[:success] = "Movie added"
        end

        Vote.create(up: true, user_id: inescapable[:submitter_id], movie_id: movie.id)

SELECT "movies".* FROM "movies"
---
    def index
        @movies = Movie.all

SELECT "users".* FROM "users"
---
    def show

        @users = User.all

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 17]]
---
    def destroy
        @movie.destroy

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 23]]
---
    def destroy_all
        Movie.destroy_all

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
---
    def define_current_movie
        if params[:id]
            @movie = Movie.find(params[:id])