app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Eddie"], ["created_at", "2018-11-13 21:18:33.076189"], ["updated_at", "2018-11-13 21:18:33.076189"]]
---
def create
    @user = User.create(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]
---
def destroy
    if @user == current_user
        @user.destroy
        session.clear
        redirect_to users_path
    elsif authorize! :destroy, @user
        @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
def instance_user
    if params[:id]
        @user = User.find(params[:id])