app/controllers/votes_controller.rb

INSERT INTO "votes" ("up", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["up", 1], ["user_id", 10], ["movie_id", 19], ["created_at", "2018-11-14 23:25:20.404210"], ["updated_at", "2018-11-14 23:25:20.404210"]]
---
    def create
        @vote = Vote.new(vote_params)
        if @vote.valid?
            @vote.save

SELECT  "votes".* FROM "votes" ORDER BY "votes"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @votes = Vote.all

DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 7]]
---
    def destroy_all
        Vote.destroy_all

SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def define_current_vote
        if params[:id].is_a?(Integer)
            @vote = Vote.find(params[:id])