app/models/movie.rb

SELECT "votes".* FROM "votes" WHERE "votes"."movie_id" = ?  [["movie_id", 1]]
---
    def tally
        total = 0
        self.votes.each do |vote|

SELECT "movies".* FROM "movies"
---
    def self.sorted_by_vote
        self.all.sort_by { |movie| movie.tally }.reverse